Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_OBSERVE_STATUS_BUSY_MASK             (0x10000000U)
#define CCM_OBSERVE_STATUS_BUSY_SHIFT            (28U)
/*! BUSY - Busy
 *  0b0..Current observe is not busy
 *  0b1..Current observe is busy
 */
#define CCM_OBSERVE_STATUS_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_BUSY_SHIFT)) & CCM_OBSERVE_STATUS_BUSY_MASK)

#define CCM_OBSERVE_STATUS_UPDATED_FORWARD_MASK  (0x20000000U)
#define CCM_OBSERVE_STATUS_UPDATED_FORWARD_SHIFT (29U)
/*! UPDATED_FORWARD - Update Forward */
#define CCM_OBSERVE_STATUS_UPDATED_FORWARD(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_UPDATED_FORWARD_SHIFT)) & CCM_OBSERVE_STATUS_UPDATED_FORWARD_MASK)

#define CCM_OBSERVE_STATUS_CHANGING_MASK         (0x80000000U)
#define CCM_OBSERVE_STATUS_CHANGING_SHIFT        (31U)
/*! CHANGING - Busy */
#define CCM_OBSERVE_STATUS_CHANGING(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_CHANGING_SHIFT)) & CCM_OBSERVE_STATUS_CHANGING_MASK)
/*! @} */

/* The count of CCM_OBSERVE_STATUS */
#define CCM_OBSERVE_STATUS_COUNT                 (2U)

/*! @name OBSERVE_AUTHEN - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_TZ_USER_MASK          (0x100U)
#define CCM_OBSERVE_AUTHEN_TZ_USER_SHIFT         (8U)
/*! TZ_USER - User access permission
 *  0b0..Observe slice settings cannot be changed in user mode.
 *  0b1..Observe slice settings can be changed in user mode.
 */
#define CCM_OBSERVE_AUTHEN_TZ_USER(x)            (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_TZ_NS_MASK            (0x200U)
#define CCM_OBSERVE_AUTHEN_TZ_NS_SHIFT           (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in non-secure mode.
 *  0b1..Can be changed in non-secure mode.
 */
#define CCM_OBSERVE_AUTHEN_TZ_NS(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_LOCK_TZ_MASK          (0x800U)
#define CCM_OBSERVE_AUTHEN_LOCK_TZ_SHIFT         (11U)
/*! LOCK_TZ - Lock TrustZone setting
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_OBSERVE_AUTHEN_LOCK_TZ(x)            (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_LOCK_TZ_MASK)

#define CCM_OBSERVE_AUTHEN_LOCK_LIST_MASK        (0x8000U)
#define CCM_OBSERVE_AUTHEN_LOCK_LIST_SHIFT       (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..White list is not locked.
 *  0b1..White list is locked.
 */
#define CCM_OBSERVE_AUTHEN_LOCK_LIST(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_LOCK_LIST_MASK)

#define CCM_OBSERVE_AUTHEN_WHITE_LIST_MASK       (0xFFFF0000U)
#define CCM_OBSERVE_AUTHEN_WHITE_LIST_SHIFT      (16U)
/*! WHITE_LIST - Whitelist settings
 *  0b0000000000000000..No domain can change.
 *  0b0000000000000001..Domain 0 can change.
 *  0b0000000000000010..Domain 1 can change.
 *  0b0000000000000011..Domain 0 and domain 1 can change.
 *  0b0000000000000100..Domain 2 can change.
 *  0b0000000000001111..All domain can change.
 */
#define CCM_OBSERVE_AUTHEN_WHITE_LIST(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_WHITE_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/* The count of CCM_OBSERVE_AUTHEN */
#define CCM_OBSERVE_AUTHEN_COUNT                 (2U)

/*! @name OBSERVE_AUTHEN_SET - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_SET_TZ_USER_MASK      (0x100U)
#define CCM_OBSERVE_AUTHEN_SET_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission */
#define CCM_OBSERVE_AUTHEN_SET_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_SET_TZ_NS_MASK        (0x200U)
#define CCM_OBSERVE_AUTHEN_SET_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_OBSERVE_AUTHEN_SET_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_MASK      (0x800U)
#define CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone setting */
#define CCM_OBSERVE_AUTHEN_SET_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_MASK    (0x8000U)
#define CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_OBSERVE_AUTHEN_SET_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_MASK)

#define CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_OBSERVE_AUTHEN_SET_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_MASK)
/*! @} */

/* The count of CCM_OBSERVE_AUTHEN_SET */
#define CCM_OBSERVE_AUTHEN_SET_COUNT             (2U)

/*! @name OBSERVE_AUTHEN_CLR - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_CLR_TZ_USER_MASK      (0x100U)
#define CCM_OBSERVE_AUTHEN_CLR_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission */
#define CCM_OBSERVE_AUTHEN_CLR_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_TZ_NS_MASK        (0x200U)
#define CCM_OBSERVE_AUTHEN_CLR_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_OBSERVE_AUTHEN_CLR_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_MASK      (0x800U)
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone setting */
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_MASK    (0x8000U)
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_MASK)

