Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED2_m33_mask_lpit2_MASK      (0x2000000U)
#define CCM_GPR_SHARED2_m33_mask_lpit2_SHIFT     (25U)
/*! m33_mask_lpit2 - m33_mask_lpit2 */
#define CCM_GPR_SHARED2_m33_mask_lpit2(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_lpit2_SHIFT)) & CCM_GPR_SHARED2_m33_mask_lpit2_MASK)

#define CCM_GPR_SHARED2_m33_mask_lpit3_MASK      (0x4000000U)
#define CCM_GPR_SHARED2_m33_mask_lpit3_SHIFT     (26U)
/*! m33_mask_lpit3 - m33_mask_lpit3 */
#define CCM_GPR_SHARED2_m33_mask_lpit3(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_lpit3_SHIFT)) & CCM_GPR_SHARED2_m33_mask_lpit3_MASK)

#define CCM_GPR_SHARED2_m33_mask_tpm1_MASK       (0x8000000U)
#define CCM_GPR_SHARED2_m33_mask_tpm1_SHIFT      (27U)
/*! m33_mask_tpm1 - m33_mask_tpm1 */
#define CCM_GPR_SHARED2_m33_mask_tpm1(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_tpm1_SHIFT)) & CCM_GPR_SHARED2_m33_mask_tpm1_MASK)

#define CCM_GPR_SHARED2_m33_mask_tpm2_MASK       (0x10000000U)
#define CCM_GPR_SHARED2_m33_mask_tpm2_SHIFT      (28U)
/*! m33_mask_tpm2 - m33_mask_tpm2 */
#define CCM_GPR_SHARED2_m33_mask_tpm2(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_tpm2_SHIFT)) & CCM_GPR_SHARED2_m33_mask_tpm2_MASK)

#define CCM_GPR_SHARED2_m33_mask_tpm3_MASK       (0x20000000U)
#define CCM_GPR_SHARED2_m33_mask_tpm3_SHIFT      (29U)
/*! m33_mask_tpm3 - m33_mask_tpm3 */
#define CCM_GPR_SHARED2_m33_mask_tpm3(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_tpm3_SHIFT)) & CCM_GPR_SHARED2_m33_mask_tpm3_MASK)

#define CCM_GPR_SHARED2_m33_mask_tpm4_MASK       (0x40000000U)
#define CCM_GPR_SHARED2_m33_mask_tpm4_SHIFT      (30U)
/*! m33_mask_tpm4 - m33_mask_tpm4 */
#define CCM_GPR_SHARED2_m33_mask_tpm4(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_tpm4_SHIFT)) & CCM_GPR_SHARED2_m33_mask_tpm4_MASK)

#define CCM_GPR_SHARED2_m33_mask_tpm5_MASK       (0x80000000U)
#define CCM_GPR_SHARED2_m33_mask_tpm5_SHIFT      (31U)
/*! m33_mask_tpm5 - m33_mask_tpm5 */
#define CCM_GPR_SHARED2_m33_mask_tpm5(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_m33_mask_tpm5_SHIFT)) & CCM_GPR_SHARED2_m33_mask_tpm5_MASK)
/*! @} */

/*! @name GPR_SHARED2_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED2_SET_m33_mask_cm7_MASK    (0x1U)
#define CCM_GPR_SHARED2_SET_m33_mask_cm7_SHIFT   (0U)
/*! m33_mask_cm7 - m33_mask_cm7 */
#define CCM_GPR_SHARED2_SET_m33_mask_cm7(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_cm7_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_cm7_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_cm33_MASK   (0x2U)
#define CCM_GPR_SHARED2_SET_m33_mask_cm33_SHIFT  (1U)
/*! m33_mask_cm33 - m33_mask_cm33 */
#define CCM_GPR_SHARED2_SET_m33_mask_cm33(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_cm33_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_cm33_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_edma3_MASK  (0x4U)
#define CCM_GPR_SHARED2_SET_m33_mask_edma3_SHIFT (2U)
/*! m33_mask_edma3 - m33_mask_edma3 */
#define CCM_GPR_SHARED2_SET_m33_mask_edma3(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_edma3_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_edma3_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_edma4_MASK  (0x8U)
#define CCM_GPR_SHARED2_SET_m33_mask_edma4_SHIFT (3U)
/*! m33_mask_edma4 - m33_mask_edma4 */
#define CCM_GPR_SHARED2_SET_m33_mask_edma4(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_edma4_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_edma4_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_netc_MASK   (0x10U)
#define CCM_GPR_SHARED2_SET_m33_mask_netc_SHIFT  (4U)
/*! m33_mask_netc - m33_mask_netc */
#define CCM_GPR_SHARED2_SET_m33_mask_netc(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_netc_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_netc_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_sim_aon_MASK (0x100U)
#define CCM_GPR_SHARED2_SET_m33_mask_sim_aon_SHIFT (8U)
/*! m33_mask_sim_aon - m33_mask_sim_aon */
#define CCM_GPR_SHARED2_SET_m33_mask_sim_aon(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_sim_aon_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_sim_aon_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_adc1_MASK   (0x200U)
#define CCM_GPR_SHARED2_SET_m33_mask_adc1_SHIFT  (9U)
/*! m33_mask_adc1 - m33_mask_adc1 */
#define CCM_GPR_SHARED2_SET_m33_mask_adc1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_adc1_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_adc1_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_adc2_MASK   (0x400U)
#define CCM_GPR_SHARED2_SET_m33_mask_adc2_SHIFT  (10U)
/*! m33_mask_adc2 - m33_mask_adc2 */
#define CCM_GPR_SHARED2_SET_m33_mask_adc2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_adc2_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_adc2_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_flexspi1_MASK (0x800U)
#define CCM_GPR_SHARED2_SET_m33_mask_flexspi1_SHIFT (11U)
/*! m33_mask_flexspi1 - m33_mask_flexspi1 */
#define CCM_GPR_SHARED2_SET_m33_mask_flexspi1(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_flexspi1_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_flexspi1_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_flexspi2_MASK (0x1000U)
#define CCM_GPR_SHARED2_SET_m33_mask_flexspi2_SHIFT (12U)
/*! m33_mask_flexspi2 - m33_mask_flexspi2 */
#define CCM_GPR_SHARED2_SET_m33_mask_flexspi2(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_flexspi2_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_flexspi2_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_trdc_MASK   (0x2000U)
#define CCM_GPR_SHARED2_SET_m33_mask_trdc_SHIFT  (13U)
/*! m33_mask_trdc - m33_mask_trdc */
#define CCM_GPR_SHARED2_SET_m33_mask_trdc(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_trdc_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_trdc_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_semc_MASK   (0x4000U)
#define CCM_GPR_SHARED2_SET_m33_mask_semc_SHIFT  (14U)
/*! m33_mask_semc - m33_mask_semc */
#define CCM_GPR_SHARED2_SET_m33_mask_semc(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_semc_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_semc_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_iee_MASK    (0x8000U)
#define CCM_GPR_SHARED2_SET_m33_mask_iee_SHIFT   (15U)
/*! m33_mask_iee - m33_mask_iee */
#define CCM_GPR_SHARED2_SET_m33_mask_iee(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_iee_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_iee_MASK)

#define CCM_GPR_SHARED2_SET_m33_mask_gpio1_MASK  (0x10000U)
#define CCM_GPR_SHARED2_SET_m33_mask_gpio1_SHIFT (16U)
/*! m33_mask_gpio1 - m33_mask_gpio1 */
#define CCM_GPR_SHARED2_SET_m33_mask_gpio1(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_SET_m33_mask_gpio1_SHIFT)) & CCM_GPR_SHARED2_SET_m33_mask_gpio1_MASK)

