Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED2_AUTHEN_TZ_NS_MASK        (0x200U)
#define CCM_GPR_SHARED2_AUTHEN_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_SHARED2_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_TZ_NS_MASK)

#define CCM_GPR_SHARED2_AUTHEN_LOCK_TZ_MASK      (0x800U)
#define CCM_GPR_SHARED2_AUTHEN_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone settings
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_GPR_SHARED2_AUTHEN_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_LOCK_TZ_MASK)

#define CCM_GPR_SHARED2_AUTHEN_LOCK_LIST_MASK    (0x8000U)
#define CCM_GPR_SHARED2_AUTHEN_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_GPR_SHARED2_AUTHEN_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_LOCK_LIST_MASK)

#define CCM_GPR_SHARED2_AUTHEN_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_GPR_SHARED2_AUTHEN_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED2_AUTHEN_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED2_AUTHEN_SET - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED2_AUTHEN_SET_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED2_AUTHEN_SET_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED2_AUTHEN_SET_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_SET_TZ_USER_MASK)

#define CCM_GPR_SHARED2_AUTHEN_SET_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED2_AUTHEN_SET_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED2_AUTHEN_SET_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_SET_TZ_NS_MASK)

#define CCM_GPR_SHARED2_AUTHEN_SET_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED2_AUTHEN_SET_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED2_AUTHEN_SET_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_GPR_SHARED2_AUTHEN_SET_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED2_AUTHEN_SET_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED2_AUTHEN_SET_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_SET_LOCK_LIST_MASK)

#define CCM_GPR_SHARED2_AUTHEN_SET_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED2_AUTHEN_SET_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED2_AUTHEN_SET_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_SET_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED2_AUTHEN_CLR - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED2_AUTHEN_CLR_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED2_AUTHEN_CLR_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED2_AUTHEN_CLR_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_CLR_TZ_USER_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_CLR_TZ_USER_MASK)

#define CCM_GPR_SHARED2_AUTHEN_CLR_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED2_AUTHEN_CLR_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED2_AUTHEN_CLR_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_CLR_TZ_NS_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_CLR_TZ_NS_MASK)

#define CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_TZ_MASK)

#define CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_CLR_LOCK_LIST_MASK)

#define CCM_GPR_SHARED2_AUTHEN_CLR_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED2_AUTHEN_CLR_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED2_AUTHEN_CLR_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_CLR_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_CLR_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED2_AUTHEN_TOG - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED2_AUTHEN_TOG_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED2_AUTHEN_TOG_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED2_AUTHEN_TOG_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_TOG_TZ_USER_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_TOG_TZ_USER_MASK)

#define CCM_GPR_SHARED2_AUTHEN_TOG_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED2_AUTHEN_TOG_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED2_AUTHEN_TOG_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_TOG_TZ_NS_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_TOG_TZ_NS_MASK)

#define CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_TZ_MASK)

#define CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_GPR_SHARED2_AUTHEN_TOG_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED2_AUTHEN_TOG_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED2_AUTHEN_TOG_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED2_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED2_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED3 - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED3_m33_mask_tpm6_MASK       (0x1U)
#define CCM_GPR_SHARED3_m33_mask_tpm6_SHIFT      (0U)
/*! m33_mask_tpm6 - m33_mask_tpm6 */
#define CCM_GPR_SHARED3_m33_mask_tpm6(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_m33_mask_tpm6_SHIFT)) & CCM_GPR_SHARED3_m33_mask_tpm6_MASK)

