Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED5_CLR_m7_mask_flexspi2_MASK (0x1000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_flexspi2_SHIFT (12U)
/*! m7_mask_flexspi2 - m7_mask_flexspi2 */
#define CCM_GPR_SHARED5_CLR_m7_mask_flexspi2(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_flexspi2_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_flexspi2_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_trdc_MASK    (0x2000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_trdc_SHIFT   (13U)
/*! m7_mask_trdc - m7_mask_trdc */
#define CCM_GPR_SHARED5_CLR_m7_mask_trdc(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_trdc_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_trdc_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_semc_MASK    (0x4000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_semc_SHIFT   (14U)
/*! m7_mask_semc - m7_mask_semc */
#define CCM_GPR_SHARED5_CLR_m7_mask_semc(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_semc_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_semc_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_iee_MASK     (0x8000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_iee_SHIFT    (15U)
/*! m7_mask_iee - m7_mask_iee */
#define CCM_GPR_SHARED5_CLR_m7_mask_iee(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_iee_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_iee_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_gpio1_MASK   (0x10000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio1_SHIFT  (16U)
/*! m7_mask_gpio1 - m7_mask_gpio1 */
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_gpio1_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_gpio1_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_gpio2_MASK   (0x20000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio2_SHIFT  (17U)
/*! m7_mask_gpio2 - m7_mask_gpio2 */
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_gpio2_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_gpio2_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_gpio3_MASK   (0x40000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio3_SHIFT  (18U)
/*! m7_mask_gpio3 - m7_mask_gpio3 */
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_gpio3_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_gpio3_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_gpio4_MASK   (0x80000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio4_SHIFT  (19U)
/*! m7_mask_gpio4 - m7_mask_gpio4 */
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio4(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_gpio4_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_gpio4_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_gpio5_MASK   (0x100000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio5_SHIFT  (20U)
/*! m7_mask_gpio5 - m7_mask_gpio5 */
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio5(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_gpio5_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_gpio5_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_gpio6_MASK   (0x200000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio6_SHIFT  (21U)
/*! m7_mask_gpio6 - m7_mask_gpio6 */
#define CCM_GPR_SHARED5_CLR_m7_mask_gpio6(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_gpio6_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_gpio6_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_flexio1_MASK (0x400000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_flexio1_SHIFT (22U)
/*! m7_mask_flexio1 - m7_mask_flexio1 */
#define CCM_GPR_SHARED5_CLR_m7_mask_flexio1(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_flexio1_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_flexio1_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_flexio2_MASK (0x800000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_flexio2_SHIFT (23U)
/*! m7_mask_flexio2 - m7_mask_flexio2 */
#define CCM_GPR_SHARED5_CLR_m7_mask_flexio2(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_flexio2_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_flexio2_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_lpit1_MASK   (0x1000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_lpit1_SHIFT  (24U)
/*! m7_mask_lpit1 - m7_mask_lpit1 */
#define CCM_GPR_SHARED5_CLR_m7_mask_lpit1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_lpit1_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_lpit1_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_lpit2_MASK   (0x2000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_lpit2_SHIFT  (25U)
/*! m7_mask_lpit2 - m7_mask_lpit2 */
#define CCM_GPR_SHARED5_CLR_m7_mask_lpit2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_lpit2_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_lpit2_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_lpit3_MASK   (0x4000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_lpit3_SHIFT  (26U)
/*! m7_mask_lpit3 - m7_mask_lpit3 */
#define CCM_GPR_SHARED5_CLR_m7_mask_lpit3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_lpit3_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_lpit3_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_tpm1_MASK    (0x8000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm1_SHIFT   (27U)
/*! m7_mask_tpm1 - m7_mask_tpm1 */
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm1(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_tpm1_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_tpm1_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_tpm2_MASK    (0x10000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm2_SHIFT   (28U)
/*! m7_mask_tpm2 - m7_mask_tpm2 */
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm2(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_tpm2_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_tpm2_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_tpm3_MASK    (0x20000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm3_SHIFT   (29U)
/*! m7_mask_tpm3 - m7_mask_tpm3 */
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm3(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_tpm3_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_tpm3_MASK)

#define CCM_GPR_SHARED5_CLR_m7_mask_tpm4_MASK    (0x40000000U)
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm4_SHIFT   (30U)
/*! m7_mask_tpm4 - m7_mask_tpm4 */
#define CCM_GPR_SHARED5_CLR_m7_mask_tpm4(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_CLR_m7_mask_tpm4_SHIFT)) & CCM_GPR_SHARED5_CLR_m7_mask_tpm4_MASK)

