Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED5_AUTHEN_SET_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED5_AUTHEN_SET_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED5_AUTHEN_SET_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_SET_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED5_AUTHEN_CLR - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED5_AUTHEN_CLR_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED5_AUTHEN_CLR_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED5_AUTHEN_CLR_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_CLR_TZ_USER_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_CLR_TZ_USER_MASK)

#define CCM_GPR_SHARED5_AUTHEN_CLR_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED5_AUTHEN_CLR_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED5_AUTHEN_CLR_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_CLR_TZ_NS_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_CLR_TZ_NS_MASK)

#define CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_TZ_MASK)

#define CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_CLR_LOCK_LIST_MASK)

#define CCM_GPR_SHARED5_AUTHEN_CLR_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED5_AUTHEN_CLR_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED5_AUTHEN_CLR_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_CLR_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_CLR_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED5_AUTHEN_TOG - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED5_AUTHEN_TOG_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED5_AUTHEN_TOG_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED5_AUTHEN_TOG_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TOG_TZ_USER_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TOG_TZ_USER_MASK)

#define CCM_GPR_SHARED5_AUTHEN_TOG_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED5_AUTHEN_TOG_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED5_AUTHEN_TOG_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TOG_TZ_NS_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TOG_TZ_NS_MASK)

#define CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_TZ_MASK)

#define CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_GPR_SHARED5_AUTHEN_TOG_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED5_AUTHEN_TOG_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED5_AUTHEN_TOG_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED5_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED5_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED6 - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED6_m7_mask_tpm6_MASK        (0x1U)
#define CCM_GPR_SHARED6_m7_mask_tpm6_SHIFT       (0U)
/*! m7_mask_tpm6 - m7_mask_tpm6 */
#define CCM_GPR_SHARED6_m7_mask_tpm6(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_tpm6_SHIFT)) & CCM_GPR_SHARED6_m7_mask_tpm6_MASK)

#define CCM_GPR_SHARED6_m7_mask_gpt1_MASK        (0x2U)
#define CCM_GPR_SHARED6_m7_mask_gpt1_SHIFT       (1U)
/*! m7_mask_gpt1 - m7_mask_gpt1 */
#define CCM_GPR_SHARED6_m7_mask_gpt1(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_gpt1_SHIFT)) & CCM_GPR_SHARED6_m7_mask_gpt1_MASK)

#define CCM_GPR_SHARED6_m7_mask_gpt2_MASK        (0x4U)
#define CCM_GPR_SHARED6_m7_mask_gpt2_SHIFT       (2U)
/*! m7_mask_gpt2 - m7_mask_gpt2 */
#define CCM_GPR_SHARED6_m7_mask_gpt2(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_gpt2_SHIFT)) & CCM_GPR_SHARED6_m7_mask_gpt2_MASK)

#define CCM_GPR_SHARED6_m7_mask_can1_MASK        (0x8U)
#define CCM_GPR_SHARED6_m7_mask_can1_SHIFT       (3U)
/*! m7_mask_can1 - m7_mask_can1 */
#define CCM_GPR_SHARED6_m7_mask_can1(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_can1_SHIFT)) & CCM_GPR_SHARED6_m7_mask_can1_MASK)

#define CCM_GPR_SHARED6_m7_mask_can2_MASK        (0x10U)
#define CCM_GPR_SHARED6_m7_mask_can2_SHIFT       (4U)
/*! m7_mask_can2 - m7_mask_can2 */
#define CCM_GPR_SHARED6_m7_mask_can2(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_can2_SHIFT)) & CCM_GPR_SHARED6_m7_mask_can2_MASK)

#define CCM_GPR_SHARED6_m7_mask_can3_MASK        (0x20U)
#define CCM_GPR_SHARED6_m7_mask_can3_SHIFT       (5U)
/*! m7_mask_can3 - m7_mask_can3 */
#define CCM_GPR_SHARED6_m7_mask_can3(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_can3_SHIFT)) & CCM_GPR_SHARED6_m7_mask_can3_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart1_MASK     (0x40U)
#define CCM_GPR_SHARED6_m7_mask_lpuart1_SHIFT    (6U)
/*! m7_mask_lpuart1 - m7_mask_lpuart1 */
#define CCM_GPR_SHARED6_m7_mask_lpuart1(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart1_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart1_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart2_MASK     (0x80U)
#define CCM_GPR_SHARED6_m7_mask_lpuart2_SHIFT    (7U)
/*! m7_mask_lpuart2 - m7_mask_lpuart2 */
#define CCM_GPR_SHARED6_m7_mask_lpuart2(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart2_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart2_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart3_MASK     (0x100U)
#define CCM_GPR_SHARED6_m7_mask_lpuart3_SHIFT    (8U)
/*! m7_mask_lpuart3 - m7_mask_lpuart3 */
#define CCM_GPR_SHARED6_m7_mask_lpuart3(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart3_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart3_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart4_MASK     (0x200U)
#define CCM_GPR_SHARED6_m7_mask_lpuart4_SHIFT    (9U)
/*! m7_mask_lpuart4 - m7_mask_lpuart4 */
#define CCM_GPR_SHARED6_m7_mask_lpuart4(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart4_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart4_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart5_MASK     (0x400U)
#define CCM_GPR_SHARED6_m7_mask_lpuart5_SHIFT    (10U)
/*! m7_mask_lpuart5 - m7_mask_lpuart5 */
#define CCM_GPR_SHARED6_m7_mask_lpuart5(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart5_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart5_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart6_MASK     (0x800U)
#define CCM_GPR_SHARED6_m7_mask_lpuart6_SHIFT    (11U)
/*! m7_mask_lpuart6 - m7_mask_lpuart6 */
#define CCM_GPR_SHARED6_m7_mask_lpuart6(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart6_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart6_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart7_MASK     (0x1000U)
#define CCM_GPR_SHARED6_m7_mask_lpuart7_SHIFT    (12U)
/*! m7_mask_lpuart7 - m7_mask_lpuart7 */
#define CCM_GPR_SHARED6_m7_mask_lpuart7(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart7_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart7_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart8_MASK     (0x2000U)
#define CCM_GPR_SHARED6_m7_mask_lpuart8_SHIFT    (13U)
/*! m7_mask_lpuart8 - m7_mask_lpuart8 */
#define CCM_GPR_SHARED6_m7_mask_lpuart8(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart8_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart8_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart9_MASK     (0x4000U)
#define CCM_GPR_SHARED6_m7_mask_lpuart9_SHIFT    (14U)
/*! m7_mask_lpuart9 - m7_mask_lpuart9 */
#define CCM_GPR_SHARED6_m7_mask_lpuart9(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart9_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart9_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart10_MASK    (0x8000U)
#define CCM_GPR_SHARED6_m7_mask_lpuart10_SHIFT   (15U)
/*! m7_mask_lpuart10 - m7_mask_lpuart10 */
#define CCM_GPR_SHARED6_m7_mask_lpuart10(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart10_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart10_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart11_MASK    (0x10000U)
#define CCM_GPR_SHARED6_m7_mask_lpuart11_SHIFT   (16U)
/*! m7_mask_lpuart11 - m7_mask_lpuart11 */
#define CCM_GPR_SHARED6_m7_mask_lpuart11(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart11_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart11_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpuart12_MASK    (0x20000U)
#define CCM_GPR_SHARED6_m7_mask_lpuart12_SHIFT   (17U)
/*! m7_mask_lpuart12 - m7_mask_lpuart12 */
#define CCM_GPR_SHARED6_m7_mask_lpuart12(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpuart12_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpuart12_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpi2c1_MASK      (0x40000U)
#define CCM_GPR_SHARED6_m7_mask_lpi2c1_SHIFT     (18U)
/*! m7_mask_lpi2c1 - m7_mask_lpi2c1 */
#define CCM_GPR_SHARED6_m7_mask_lpi2c1(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpi2c1_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpi2c1_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpi2c2_MASK      (0x80000U)
#define CCM_GPR_SHARED6_m7_mask_lpi2c2_SHIFT     (19U)
/*! m7_mask_lpi2c2 - m7_mask_lpi2c2 */
#define CCM_GPR_SHARED6_m7_mask_lpi2c2(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpi2c2_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpi2c2_MASK)

#define CCM_GPR_SHARED6_m7_mask_lpi2c3_MASK      (0x100000U)
#define CCM_GPR_SHARED6_m7_mask_lpi2c3_SHIFT     (20U)
/*! m7_mask_lpi2c3 - m7_mask_lpi2c3 */
#define CCM_GPR_SHARED6_m7_mask_lpi2c3(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_m7_mask_lpi2c3_SHIFT)) & CCM_GPR_SHARED6_m7_mask_lpi2c3_MASK)

