Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart3_MASK (0x100U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart3_SHIFT (8U)
/*! m7_mask_lpuart3 - m7_mask_lpuart3 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart3(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart3_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart3_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart4_MASK (0x200U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart4_SHIFT (9U)
/*! m7_mask_lpuart4 - m7_mask_lpuart4 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart4(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart4_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart4_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart5_MASK (0x400U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart5_SHIFT (10U)
/*! m7_mask_lpuart5 - m7_mask_lpuart5 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart5(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart5_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart5_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart6_MASK (0x800U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart6_SHIFT (11U)
/*! m7_mask_lpuart6 - m7_mask_lpuart6 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart6(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart6_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart6_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart7_MASK (0x1000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart7_SHIFT (12U)
/*! m7_mask_lpuart7 - m7_mask_lpuart7 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart7(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart7_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart7_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart8_MASK (0x2000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart8_SHIFT (13U)
/*! m7_mask_lpuart8 - m7_mask_lpuart8 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart8(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart8_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart8_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart9_MASK (0x4000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart9_SHIFT (14U)
/*! m7_mask_lpuart9 - m7_mask_lpuart9 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart9(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart9_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart9_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart10_MASK (0x8000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart10_SHIFT (15U)
/*! m7_mask_lpuart10 - m7_mask_lpuart10 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart10(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart10_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart10_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart11_MASK (0x10000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart11_SHIFT (16U)
/*! m7_mask_lpuart11 - m7_mask_lpuart11 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart11(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart11_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart11_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpuart12_MASK (0x20000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart12_SHIFT (17U)
/*! m7_mask_lpuart12 - m7_mask_lpuart12 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpuart12(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpuart12_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpuart12_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c1_MASK  (0x40000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c1_SHIFT (18U)
/*! m7_mask_lpi2c1 - m7_mask_lpi2c1 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c1(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpi2c1_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpi2c1_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c2_MASK  (0x80000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c2_SHIFT (19U)
/*! m7_mask_lpi2c2 - m7_mask_lpi2c2 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c2(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpi2c2_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpi2c2_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c3_MASK  (0x100000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c3_SHIFT (20U)
/*! m7_mask_lpi2c3 - m7_mask_lpi2c3 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c3(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpi2c3_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpi2c3_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c4_MASK  (0x200000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c4_SHIFT (21U)
/*! m7_mask_lpi2c4 - m7_mask_lpi2c4 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c4(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpi2c4_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpi2c4_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c5_MASK  (0x400000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c5_SHIFT (22U)
/*! m7_mask_lpi2c5 - m7_mask_lpi2c5 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c5(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpi2c5_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpi2c5_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c6_MASK  (0x800000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c6_SHIFT (23U)
/*! m7_mask_lpi2c6 - m7_mask_lpi2c6 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpi2c6(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpi2c6_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpi2c6_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpspi1_MASK  (0x1000000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpspi1_SHIFT (24U)
/*! m7_mask_lpspi1 - m7_mask_lpspi1 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpspi1(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpspi1_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpspi1_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpspi2_MASK  (0x2000000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpspi2_SHIFT (25U)
/*! m7_mask_lpspi2 - m7_mask_lpspi2 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpspi2(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpspi2_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpspi2_MASK)

#define CCM_GPR_SHARED6_SET_m7_mask_lpspi3_MASK  (0x4000000U)
#define CCM_GPR_SHARED6_SET_m7_mask_lpspi3_SHIFT (26U)
/*! m7_mask_lpspi3 - m7_mask_lpspi3 */
#define CCM_GPR_SHARED6_SET_m7_mask_lpspi3(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_SET_m7_mask_lpspi3_SHIFT)) & CCM_GPR_SHARED6_SET_m7_mask_lpspi3_MASK)

