Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED6_AUTHEN_TOG_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED6_AUTHEN_TOG_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED6_AUTHEN_TOG_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED6_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_GPR_SHARED6_AUTHEN_TOG_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED6_AUTHEN_TOG_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED6_AUTHEN_TOG_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED6_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED6_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED7 - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED7_m7_mask_sinc3_MASK       (0x1U)
#define CCM_GPR_SHARED7_m7_mask_sinc3_SHIFT      (0U)
/*! m7_mask_sinc3 - m7_mask_sinc3 */
#define CCM_GPR_SHARED7_m7_mask_sinc3(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_m7_mask_sinc3_SHIFT)) & CCM_GPR_SHARED7_m7_mask_sinc3_MASK)

#define CCM_GPR_SHARED7_m7_mask_sai1_MASK        (0x2U)
#define CCM_GPR_SHARED7_m7_mask_sai1_SHIFT       (1U)
/*! m7_mask_sai1 - m7_mask_sai1 */
#define CCM_GPR_SHARED7_m7_mask_sai1(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_m7_mask_sai1_SHIFT)) & CCM_GPR_SHARED7_m7_mask_sai1_MASK)

#define CCM_GPR_SHARED7_m7_mask_sai2_MASK        (0x4U)
#define CCM_GPR_SHARED7_m7_mask_sai2_SHIFT       (2U)
/*! m7_mask_sai2 - m7_mask_sai2 */
#define CCM_GPR_SHARED7_m7_mask_sai2(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_m7_mask_sai2_SHIFT)) & CCM_GPR_SHARED7_m7_mask_sai2_MASK)

#define CCM_GPR_SHARED7_m7_mask_sai3_MASK        (0x8U)
#define CCM_GPR_SHARED7_m7_mask_sai3_SHIFT       (3U)
/*! m7_mask_sai3 - m7_mask_sai3 */
#define CCM_GPR_SHARED7_m7_mask_sai3(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_m7_mask_sai3_SHIFT)) & CCM_GPR_SHARED7_m7_mask_sai3_MASK)

#define CCM_GPR_SHARED7_m7_mask_sai4_MASK        (0x10U)
#define CCM_GPR_SHARED7_m7_mask_sai4_SHIFT       (4U)
/*! m7_mask_sai4 - m7_mask_sai4 */
#define CCM_GPR_SHARED7_m7_mask_sai4(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_m7_mask_sai4_SHIFT)) & CCM_GPR_SHARED7_m7_mask_sai4_MASK)

#define CCM_GPR_SHARED7_m7_mask_mic_MASK         (0x20U)
#define CCM_GPR_SHARED7_m7_mask_mic_SHIFT        (5U)
/*! m7_mask_mic - m7_mask_mic */
#define CCM_GPR_SHARED7_m7_mask_mic(x)           (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_m7_mask_mic_SHIFT)) & CCM_GPR_SHARED7_m7_mask_mic_MASK)
/*! @} */

/*! @name GPR_SHARED7_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED7_SET_m7_mask_sinc3_MASK   (0x1U)
#define CCM_GPR_SHARED7_SET_m7_mask_sinc3_SHIFT  (0U)
/*! m7_mask_sinc3 - m7_mask_sinc3 */
#define CCM_GPR_SHARED7_SET_m7_mask_sinc3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_SET_m7_mask_sinc3_SHIFT)) & CCM_GPR_SHARED7_SET_m7_mask_sinc3_MASK)

#define CCM_GPR_SHARED7_SET_m7_mask_sai1_MASK    (0x2U)
#define CCM_GPR_SHARED7_SET_m7_mask_sai1_SHIFT   (1U)
/*! m7_mask_sai1 - m7_mask_sai1 */
#define CCM_GPR_SHARED7_SET_m7_mask_sai1(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_SET_m7_mask_sai1_SHIFT)) & CCM_GPR_SHARED7_SET_m7_mask_sai1_MASK)

#define CCM_GPR_SHARED7_SET_m7_mask_sai2_MASK    (0x4U)
#define CCM_GPR_SHARED7_SET_m7_mask_sai2_SHIFT   (2U)
/*! m7_mask_sai2 - m7_mask_sai2 */
#define CCM_GPR_SHARED7_SET_m7_mask_sai2(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_SET_m7_mask_sai2_SHIFT)) & CCM_GPR_SHARED7_SET_m7_mask_sai2_MASK)

#define CCM_GPR_SHARED7_SET_m7_mask_sai3_MASK    (0x8U)
#define CCM_GPR_SHARED7_SET_m7_mask_sai3_SHIFT   (3U)
/*! m7_mask_sai3 - m7_mask_sai3 */
#define CCM_GPR_SHARED7_SET_m7_mask_sai3(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_SET_m7_mask_sai3_SHIFT)) & CCM_GPR_SHARED7_SET_m7_mask_sai3_MASK)

#define CCM_GPR_SHARED7_SET_m7_mask_sai4_MASK    (0x10U)
#define CCM_GPR_SHARED7_SET_m7_mask_sai4_SHIFT   (4U)
/*! m7_mask_sai4 - m7_mask_sai4 */
#define CCM_GPR_SHARED7_SET_m7_mask_sai4(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_SET_m7_mask_sai4_SHIFT)) & CCM_GPR_SHARED7_SET_m7_mask_sai4_MASK)

#define CCM_GPR_SHARED7_SET_m7_mask_mic_MASK     (0x20U)
#define CCM_GPR_SHARED7_SET_m7_mask_mic_SHIFT    (5U)
/*! m7_mask_mic - m7_mask_mic */
#define CCM_GPR_SHARED7_SET_m7_mask_mic(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_SET_m7_mask_mic_SHIFT)) & CCM_GPR_SHARED7_SET_m7_mask_mic_MASK)
/*! @} */

/*! @name GPR_SHARED7_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED7_CLR_m7_mask_sinc3_MASK   (0x1U)
#define CCM_GPR_SHARED7_CLR_m7_mask_sinc3_SHIFT  (0U)
/*! m7_mask_sinc3 - m7_mask_sinc3 */
#define CCM_GPR_SHARED7_CLR_m7_mask_sinc3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_CLR_m7_mask_sinc3_SHIFT)) & CCM_GPR_SHARED7_CLR_m7_mask_sinc3_MASK)

#define CCM_GPR_SHARED7_CLR_m7_mask_sai1_MASK    (0x2U)
#define CCM_GPR_SHARED7_CLR_m7_mask_sai1_SHIFT   (1U)
/*! m7_mask_sai1 - m7_mask_sai1 */
#define CCM_GPR_SHARED7_CLR_m7_mask_sai1(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_CLR_m7_mask_sai1_SHIFT)) & CCM_GPR_SHARED7_CLR_m7_mask_sai1_MASK)

#define CCM_GPR_SHARED7_CLR_m7_mask_sai2_MASK    (0x4U)
#define CCM_GPR_SHARED7_CLR_m7_mask_sai2_SHIFT   (2U)
/*! m7_mask_sai2 - m7_mask_sai2 */
#define CCM_GPR_SHARED7_CLR_m7_mask_sai2(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_CLR_m7_mask_sai2_SHIFT)) & CCM_GPR_SHARED7_CLR_m7_mask_sai2_MASK)

#define CCM_GPR_SHARED7_CLR_m7_mask_sai3_MASK    (0x8U)
#define CCM_GPR_SHARED7_CLR_m7_mask_sai3_SHIFT   (3U)
/*! m7_mask_sai3 - m7_mask_sai3 */
#define CCM_GPR_SHARED7_CLR_m7_mask_sai3(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_CLR_m7_mask_sai3_SHIFT)) & CCM_GPR_SHARED7_CLR_m7_mask_sai3_MASK)

#define CCM_GPR_SHARED7_CLR_m7_mask_sai4_MASK    (0x10U)
#define CCM_GPR_SHARED7_CLR_m7_mask_sai4_SHIFT   (4U)
/*! m7_mask_sai4 - m7_mask_sai4 */
#define CCM_GPR_SHARED7_CLR_m7_mask_sai4(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_CLR_m7_mask_sai4_SHIFT)) & CCM_GPR_SHARED7_CLR_m7_mask_sai4_MASK)

#define CCM_GPR_SHARED7_CLR_m7_mask_mic_MASK     (0x20U)
#define CCM_GPR_SHARED7_CLR_m7_mask_mic_SHIFT    (5U)
/*! m7_mask_mic - m7_mask_mic */
#define CCM_GPR_SHARED7_CLR_m7_mask_mic(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED7_CLR_m7_mask_mic_SHIFT)) & CCM_GPR_SHARED7_CLR_m7_mask_mic_MASK)
/*! @} */

/*! @name GPR_SHARED7_TOG - General Purpose Register */
/*! @{ */

