Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED8_CLR_m33_lpuart1_ipg_stop_MASK (0x8000000U)
#define CCM_GPR_SHARED8_CLR_m33_lpuart1_ipg_stop_SHIFT (27U)
/*! m33_lpuart1_ipg_stop - m33_lpuart1_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_lpuart1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_lpuart1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_lpuart1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_lpuart2_ipg_stop_MASK (0x10000000U)
#define CCM_GPR_SHARED8_CLR_m33_lpuart2_ipg_stop_SHIFT (28U)
/*! m33_lpuart2_ipg_stop - m33_lpuart2_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_lpuart2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_lpuart2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_lpuart2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_lpuart3_ipg_stop_MASK (0x20000000U)
#define CCM_GPR_SHARED8_CLR_m33_lpuart3_ipg_stop_SHIFT (29U)
/*! m33_lpuart3_ipg_stop - m33_lpuart3_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_lpuart3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_lpuart3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_lpuart3_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_lpuart4_ipg_stop_MASK (0x40000000U)
#define CCM_GPR_SHARED8_CLR_m33_lpuart4_ipg_stop_SHIFT (30U)
/*! m33_lpuart4_ipg_stop - m33_lpuart4_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_lpuart4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_lpuart4_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_lpuart4_ipg_stop_MASK)

#define CCM_GPR_SHARED8_CLR_m33_lpuart5_ipg_stop_MASK (0x80000000U)
#define CCM_GPR_SHARED8_CLR_m33_lpuart5_ipg_stop_SHIFT (31U)
/*! m33_lpuart5_ipg_stop - m33_lpuart5_ipg_stop */
#define CCM_GPR_SHARED8_CLR_m33_lpuart5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_CLR_m33_lpuart5_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_CLR_m33_lpuart5_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED8_TOG - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED8_TOG_m33_cm7_ipg_stop_MASK (0x1U)
#define CCM_GPR_SHARED8_TOG_m33_cm7_ipg_stop_SHIFT (0U)
/*! m33_cm7_ipg_stop - m33_cm7_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_cm7_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_cm7_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_cm7_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_cm33_ipg_stop_MASK (0x2U)
#define CCM_GPR_SHARED8_TOG_m33_cm33_ipg_stop_SHIFT (1U)
/*! m33_cm33_ipg_stop - m33_cm33_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_cm33_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_cm33_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_cm33_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_edma3_ipg_stop_MASK (0x4U)
#define CCM_GPR_SHARED8_TOG_m33_edma3_ipg_stop_SHIFT (2U)
/*! m33_edma3_ipg_stop - m33_edma3_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_edma3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_edma3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_edma3_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_edma4_ipg_stop_MASK (0x8U)
#define CCM_GPR_SHARED8_TOG_m33_edma4_ipg_stop_SHIFT (3U)
/*! m33_edma4_ipg_stop - m33_edma4_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_edma4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_edma4_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_edma4_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_netc_ipg_stop_MASK (0x10U)
#define CCM_GPR_SHARED8_TOG_m33_netc_ipg_stop_SHIFT (4U)
/*! m33_netc_ipg_stop - m33_netc_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_netc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_netc_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_netc_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_sim_aon_ipg_stop_MASK (0x100U)
#define CCM_GPR_SHARED8_TOG_m33_sim_aon_ipg_stop_SHIFT (8U)
/*! m33_sim_aon_ipg_stop - m33_sim_aon_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_sim_aon_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_sim_aon_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_sim_aon_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_adc1_ipg_stop_MASK (0x200U)
#define CCM_GPR_SHARED8_TOG_m33_adc1_ipg_stop_SHIFT (9U)
/*! m33_adc1_ipg_stop - m33_adc1_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_adc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_adc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_adc1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_adc2_ipg_stop_MASK (0x400U)
#define CCM_GPR_SHARED8_TOG_m33_adc2_ipg_stop_SHIFT (10U)
/*! m33_adc2_ipg_stop - m33_adc2_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_adc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_adc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_adc2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_flexspi1_ipg_stop_MASK (0x800U)
#define CCM_GPR_SHARED8_TOG_m33_flexspi1_ipg_stop_SHIFT (11U)
/*! m33_flexspi1_ipg_stop - m33_flexspi1_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_flexspi1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_flexspi1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_flexspi1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_flexspi2_ipg_stop_MASK (0x1000U)
#define CCM_GPR_SHARED8_TOG_m33_flexspi2_ipg_stop_SHIFT (12U)
/*! m33_flexspi2_ipg_stop - m33_flexspi2_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_flexspi2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_flexspi2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_flexspi2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_trdc_ipg_stop_MASK (0x2000U)
#define CCM_GPR_SHARED8_TOG_m33_trdc_ipg_stop_SHIFT (13U)
/*! m33_trdc_ipg_stop - m33_trdc_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_trdc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_trdc_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_trdc_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_semc_ipg_stop_MASK (0x4000U)
#define CCM_GPR_SHARED8_TOG_m33_semc_ipg_stop_SHIFT (14U)
/*! m33_semc_ipg_stop - m33_semc_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_semc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_semc_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_semc_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_iee_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED8_TOG_m33_iee_ipg_stop_SHIFT (15U)
/*! m33_iee_ipg_stop - m33_iee_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_iee_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_iee_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_iee_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_gpio1_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED8_TOG_m33_gpio1_ipg_stop_SHIFT (16U)
/*! m33_gpio1_ipg_stop - m33_gpio1_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_gpio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_gpio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_gpio1_ipg_stop_MASK)

