Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED10_TOG_m33_lpit1_ipg_doze_MASK (0x40U)
#define CCM_GPR_SHARED10_TOG_m33_lpit1_ipg_doze_SHIFT (6U)
/*! m33_lpit1_ipg_doze - m33_lpit1_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpit1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpit1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpit1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_lpit2_ipg_doze_MASK (0x80U)
#define CCM_GPR_SHARED10_TOG_m33_lpit2_ipg_doze_SHIFT (7U)
/*! m33_lpit2_ipg_doze - m33_lpit2_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpit2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpit2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpit2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_lpit3_ipg_doze_MASK (0x100U)
#define CCM_GPR_SHARED10_TOG_m33_lpit3_ipg_doze_SHIFT (8U)
/*! m33_lpit3_ipg_doze - m33_lpit3_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpit3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpit3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpit3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_tpm1_ipg_doze_MASK (0x200U)
#define CCM_GPR_SHARED10_TOG_m33_tpm1_ipg_doze_SHIFT (9U)
/*! m33_tpm1_ipg_doze - m33_tpm1_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_tpm1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_tpm1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_tpm1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_tpm2_ipg_doze_MASK (0x400U)
#define CCM_GPR_SHARED10_TOG_m33_tpm2_ipg_doze_SHIFT (10U)
/*! m33_tpm2_ipg_doze - m33_tpm2_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_tpm2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_tpm2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_tpm2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_tpm3_ipg_doze_MASK (0x800U)
#define CCM_GPR_SHARED10_TOG_m33_tpm3_ipg_doze_SHIFT (11U)
/*! m33_tpm3_ipg_doze - m33_tpm3_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_tpm3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_tpm3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_tpm3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_tpm4_ipg_doze_MASK (0x1000U)
#define CCM_GPR_SHARED10_TOG_m33_tpm4_ipg_doze_SHIFT (12U)
/*! m33_tpm4_ipg_doze - m33_tpm4_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_tpm4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_tpm4_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_tpm4_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_tpm5_ipg_doze_MASK (0x2000U)
#define CCM_GPR_SHARED10_TOG_m33_tpm5_ipg_doze_SHIFT (13U)
/*! m33_tpm5_ipg_doze - m33_tpm5_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_tpm5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_tpm5_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_tpm5_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_tpm6_ipg_doze_MASK (0x4000U)
#define CCM_GPR_SHARED10_TOG_m33_tpm6_ipg_doze_SHIFT (14U)
/*! m33_tpm6_ipg_doze - m33_tpm6_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_tpm6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_tpm6_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_tpm6_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_gpt1_ipg_doze_MASK (0x8000U)
#define CCM_GPR_SHARED10_TOG_m33_gpt1_ipg_doze_SHIFT (15U)
/*! m33_gpt1_ipg_doze - m33_gpt1_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_gpt1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_gpt1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_gpt1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_gpt2_ipg_doze_MASK (0x10000U)
#define CCM_GPR_SHARED10_TOG_m33_gpt2_ipg_doze_SHIFT (16U)
/*! m33_gpt2_ipg_doze - m33_gpt2_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_gpt2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_gpt2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_gpt2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_can1_ipg_doze_MASK (0x20000U)
#define CCM_GPR_SHARED10_TOG_m33_can1_ipg_doze_SHIFT (17U)
/*! m33_can1_ipg_doze - m33_can1_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_can1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_can1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_can1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_can2_ipg_doze_MASK (0x40000U)
#define CCM_GPR_SHARED10_TOG_m33_can2_ipg_doze_SHIFT (18U)
/*! m33_can2_ipg_doze - m33_can2_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_can2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_can2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_can2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_can3_ipg_doze_MASK (0x80000U)
#define CCM_GPR_SHARED10_TOG_m33_can3_ipg_doze_SHIFT (19U)
/*! m33_can3_ipg_doze - m33_can3_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_can3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_can3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_can3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_lpuart1_ipg_doze_MASK (0x100000U)
#define CCM_GPR_SHARED10_TOG_m33_lpuart1_ipg_doze_SHIFT (20U)
/*! m33_lpuart1_ipg_doze - m33_lpuart1_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpuart1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpuart1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpuart1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_lpuart2_ipg_doze_MASK (0x200000U)
#define CCM_GPR_SHARED10_TOG_m33_lpuart2_ipg_doze_SHIFT (21U)
/*! m33_lpuart2_ipg_doze - m33_lpuart2_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpuart2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpuart2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpuart2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_lpuart3_ipg_doze_MASK (0x400000U)
#define CCM_GPR_SHARED10_TOG_m33_lpuart3_ipg_doze_SHIFT (22U)
/*! m33_lpuart3_ipg_doze - m33_lpuart3_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpuart3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpuart3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpuart3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_TOG_m33_lpuart4_ipg_doze_MASK (0x800000U)
#define CCM_GPR_SHARED10_TOG_m33_lpuart4_ipg_doze_SHIFT (23U)
/*! m33_lpuart4_ipg_doze - m33_lpuart4_ipg_doze */
#define CCM_GPR_SHARED10_TOG_m33_lpuart4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_TOG_m33_lpuart4_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_TOG_m33_lpuart4_ipg_doze_MASK)

