Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED11_m33_lpspi6_ipg_doze_MASK (0x800U)
#define CCM_GPR_SHARED11_m33_lpspi6_ipg_doze_SHIFT (11U)
/*! m33_lpspi6_ipg_doze - m33_lpspi6_ipg_doze */
#define CCM_GPR_SHARED11_m33_lpspi6_ipg_doze(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_m33_lpspi6_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_m33_lpspi6_ipg_doze_MASK)

#define CCM_GPR_SHARED11_m33_sinc1_ipg_doze_MASK (0x1000U)
#define CCM_GPR_SHARED11_m33_sinc1_ipg_doze_SHIFT (12U)
/*! m33_sinc1_ipg_doze - m33_sinc1_ipg_doze */
#define CCM_GPR_SHARED11_m33_sinc1_ipg_doze(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_m33_sinc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_m33_sinc1_ipg_doze_MASK)

#define CCM_GPR_SHARED11_m33_sinc2_ipg_doze_MASK (0x2000U)
#define CCM_GPR_SHARED11_m33_sinc2_ipg_doze_SHIFT (13U)
/*! m33_sinc2_ipg_doze - m33_sinc2_ipg_doze */
#define CCM_GPR_SHARED11_m33_sinc2_ipg_doze(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_m33_sinc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_m33_sinc2_ipg_doze_MASK)

#define CCM_GPR_SHARED11_m33_sinc3_ipg_doze_MASK (0x4000U)
#define CCM_GPR_SHARED11_m33_sinc3_ipg_doze_SHIFT (14U)
/*! m33_sinc3_ipg_doze - m33_sinc3_ipg_doze */
#define CCM_GPR_SHARED11_m33_sinc3_ipg_doze(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_m33_sinc3_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_m33_sinc3_ipg_doze_MASK)

#define CCM_GPR_SHARED11_m33_mic_ipg_doze_MASK   (0x8000U)
#define CCM_GPR_SHARED11_m33_mic_ipg_doze_SHIFT  (15U)
/*! m33_mic_ipg_doze - m33_mic_ipg_doze */
#define CCM_GPR_SHARED11_m33_mic_ipg_doze(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_m33_mic_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_m33_mic_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED11_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED11_SET_m33_lpi2c1_ipg_doze_MASK (0x1U)
#define CCM_GPR_SHARED11_SET_m33_lpi2c1_ipg_doze_SHIFT (0U)
/*! m33_lpi2c1_ipg_doze - m33_lpi2c1_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpi2c1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpi2c1_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpi2c1_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpi2c2_ipg_doze_MASK (0x2U)
#define CCM_GPR_SHARED11_SET_m33_lpi2c2_ipg_doze_SHIFT (1U)
/*! m33_lpi2c2_ipg_doze - m33_lpi2c2_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpi2c2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpi2c2_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpi2c2_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpi2c3_ipg_doze_MASK (0x4U)
#define CCM_GPR_SHARED11_SET_m33_lpi2c3_ipg_doze_SHIFT (2U)
/*! m33_lpi2c3_ipg_doze - m33_lpi2c3_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpi2c3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpi2c3_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpi2c3_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpi2c4_ipg_doze_MASK (0x8U)
#define CCM_GPR_SHARED11_SET_m33_lpi2c4_ipg_doze_SHIFT (3U)
/*! m33_lpi2c4_ipg_doze - m33_lpi2c4_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpi2c4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpi2c4_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpi2c4_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpi2c5_ipg_doze_MASK (0x10U)
#define CCM_GPR_SHARED11_SET_m33_lpi2c5_ipg_doze_SHIFT (4U)
/*! m33_lpi2c5_ipg_doze - m33_lpi2c5_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpi2c5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpi2c5_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpi2c5_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpi2c6_ipg_doze_MASK (0x20U)
#define CCM_GPR_SHARED11_SET_m33_lpi2c6_ipg_doze_SHIFT (5U)
/*! m33_lpi2c6_ipg_doze - m33_lpi2c6_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpi2c6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpi2c6_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpi2c6_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpspi1_ipg_doze_MASK (0x40U)
#define CCM_GPR_SHARED11_SET_m33_lpspi1_ipg_doze_SHIFT (6U)
/*! m33_lpspi1_ipg_doze - m33_lpspi1_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpspi1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpspi1_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpspi1_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpspi2_ipg_doze_MASK (0x80U)
#define CCM_GPR_SHARED11_SET_m33_lpspi2_ipg_doze_SHIFT (7U)
/*! m33_lpspi2_ipg_doze - m33_lpspi2_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpspi2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpspi2_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpspi2_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpspi3_ipg_doze_MASK (0x100U)
#define CCM_GPR_SHARED11_SET_m33_lpspi3_ipg_doze_SHIFT (8U)
/*! m33_lpspi3_ipg_doze - m33_lpspi3_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpspi3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpspi3_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpspi3_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpspi4_ipg_doze_MASK (0x200U)
#define CCM_GPR_SHARED11_SET_m33_lpspi4_ipg_doze_SHIFT (9U)
/*! m33_lpspi4_ipg_doze - m33_lpspi4_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpspi4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpspi4_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpspi4_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpspi5_ipg_doze_MASK (0x400U)
#define CCM_GPR_SHARED11_SET_m33_lpspi5_ipg_doze_SHIFT (10U)
/*! m33_lpspi5_ipg_doze - m33_lpspi5_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpspi5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpspi5_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpspi5_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_lpspi6_ipg_doze_MASK (0x800U)
#define CCM_GPR_SHARED11_SET_m33_lpspi6_ipg_doze_SHIFT (11U)
/*! m33_lpspi6_ipg_doze - m33_lpspi6_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_lpspi6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_lpspi6_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_lpspi6_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_sinc1_ipg_doze_MASK (0x1000U)
#define CCM_GPR_SHARED11_SET_m33_sinc1_ipg_doze_SHIFT (12U)
/*! m33_sinc1_ipg_doze - m33_sinc1_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_sinc1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_sinc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_sinc1_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_sinc2_ipg_doze_MASK (0x2000U)
#define CCM_GPR_SHARED11_SET_m33_sinc2_ipg_doze_SHIFT (13U)
/*! m33_sinc2_ipg_doze - m33_sinc2_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_sinc2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_sinc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_sinc2_ipg_doze_MASK)

#define CCM_GPR_SHARED11_SET_m33_sinc3_ipg_doze_MASK (0x4000U)
#define CCM_GPR_SHARED11_SET_m33_sinc3_ipg_doze_SHIFT (14U)
/*! m33_sinc3_ipg_doze - m33_sinc3_ipg_doze */
#define CCM_GPR_SHARED11_SET_m33_sinc3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED11_SET_m33_sinc3_ipg_doze_SHIFT)) & CCM_GPR_SHARED11_SET_m33_sinc3_ipg_doze_MASK)

