Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED12_CLR_m7_edma3_ipg_stop_MASK (0x4U)
#define CCM_GPR_SHARED12_CLR_m7_edma3_ipg_stop_SHIFT (2U)
/*! m7_edma3_ipg_stop - m7_edma3_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_edma3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_edma3_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_edma3_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_edma4_ipg_stop_MASK (0x8U)
#define CCM_GPR_SHARED12_CLR_m7_edma4_ipg_stop_SHIFT (3U)
/*! m7_edma4_ipg_stop - m7_edma4_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_edma4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_edma4_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_edma4_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_netc_ipg_stop_MASK (0x10U)
#define CCM_GPR_SHARED12_CLR_m7_netc_ipg_stop_SHIFT (4U)
/*! m7_netc_ipg_stop - m7_netc_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_netc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_netc_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_netc_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_sim_aon_ipg_stop_MASK (0x100U)
#define CCM_GPR_SHARED12_CLR_m7_sim_aon_ipg_stop_SHIFT (8U)
/*! m7_sim_aon_ipg_stop - m7_sim_aon_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_sim_aon_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_sim_aon_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_sim_aon_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_adc1_ipg_stop_MASK (0x200U)
#define CCM_GPR_SHARED12_CLR_m7_adc1_ipg_stop_SHIFT (9U)
/*! m7_adc1_ipg_stop - m7_adc1_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_adc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_adc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_adc1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_adc2_ipg_stop_MASK (0x400U)
#define CCM_GPR_SHARED12_CLR_m7_adc2_ipg_stop_SHIFT (10U)
/*! m7_adc2_ipg_stop - m7_adc2_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_adc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_adc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_adc2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_flexspi1_ipg_stop_MASK (0x800U)
#define CCM_GPR_SHARED12_CLR_m7_flexspi1_ipg_stop_SHIFT (11U)
/*! m7_flexspi1_ipg_stop - m7_flexspi1_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_flexspi1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_flexspi1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_flexspi1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_flexspi2_ipg_stop_MASK (0x1000U)
#define CCM_GPR_SHARED12_CLR_m7_flexspi2_ipg_stop_SHIFT (12U)
/*! m7_flexspi2_ipg_stop - m7_flexspi2_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_flexspi2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_flexspi2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_flexspi2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_trdc_ipg_stop_MASK (0x2000U)
#define CCM_GPR_SHARED12_CLR_m7_trdc_ipg_stop_SHIFT (13U)
/*! m7_trdc_ipg_stop - m7_trdc_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_trdc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_trdc_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_trdc_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_semc_ipg_stop_MASK (0x4000U)
#define CCM_GPR_SHARED12_CLR_m7_semc_ipg_stop_SHIFT (14U)
/*! m7_semc_ipg_stop - m7_semc_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_semc_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_semc_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_semc_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_iee_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED12_CLR_m7_iee_ipg_stop_SHIFT (15U)
/*! m7_iee_ipg_stop - m7_iee_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_iee_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_iee_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_iee_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_gpio1_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED12_CLR_m7_gpio1_ipg_stop_SHIFT (16U)
/*! m7_gpio1_ipg_stop - m7_gpio1_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_gpio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_gpio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_gpio1_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_gpio2_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED12_CLR_m7_gpio2_ipg_stop_SHIFT (17U)
/*! m7_gpio2_ipg_stop - m7_gpio2_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_gpio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_gpio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_gpio2_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_gpio3_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED12_CLR_m7_gpio3_ipg_stop_SHIFT (18U)
/*! m7_gpio3_ipg_stop - m7_gpio3_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_gpio3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_gpio3_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_gpio3_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_gpio4_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED12_CLR_m7_gpio4_ipg_stop_SHIFT (19U)
/*! m7_gpio4_ipg_stop - m7_gpio4_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_gpio4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_gpio4_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_gpio4_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_gpio5_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED12_CLR_m7_gpio5_ipg_stop_SHIFT (20U)
/*! m7_gpio5_ipg_stop - m7_gpio5_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_gpio5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_gpio5_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_gpio5_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_gpio6_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED12_CLR_m7_gpio6_ipg_stop_SHIFT (21U)
/*! m7_gpio6_ipg_stop - m7_gpio6_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_gpio6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_gpio6_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_gpio6_ipg_stop_MASK)

#define CCM_GPR_SHARED12_CLR_m7_flexio1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED12_CLR_m7_flexio1_ipg_stop_SHIFT (22U)
/*! m7_flexio1_ipg_stop - m7_flexio1_ipg_stop */
#define CCM_GPR_SHARED12_CLR_m7_flexio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED12_CLR_m7_flexio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED12_CLR_m7_flexio1_ipg_stop_MASK)

