Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED13_AUTHEN_SET_LOCK_TZ_MASK (0x800U)
#define CCM_GPR_SHARED13_AUTHEN_SET_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED13_AUTHEN_SET_LOCK_TZ(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_GPR_SHARED13_AUTHEN_SET_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED13_AUTHEN_SET_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED13_AUTHEN_SET_LOCK_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_SET_LOCK_LIST_MASK)

#define CCM_GPR_SHARED13_AUTHEN_SET_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED13_AUTHEN_SET_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED13_AUTHEN_SET_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_SET_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED13_AUTHEN_CLR - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED13_AUTHEN_CLR_TZ_USER_MASK (0x100U)
#define CCM_GPR_SHARED13_AUTHEN_CLR_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED13_AUTHEN_CLR_TZ_USER(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_CLR_TZ_USER_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_CLR_TZ_USER_MASK)

#define CCM_GPR_SHARED13_AUTHEN_CLR_TZ_NS_MASK   (0x200U)
#define CCM_GPR_SHARED13_AUTHEN_CLR_TZ_NS_SHIFT  (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED13_AUTHEN_CLR_TZ_NS(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_CLR_TZ_NS_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_CLR_TZ_NS_MASK)

#define CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_TZ_MASK (0x800U)
#define CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_TZ(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_TZ_MASK)

#define CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_CLR_LOCK_LIST_MASK)

#define CCM_GPR_SHARED13_AUTHEN_CLR_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED13_AUTHEN_CLR_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED13_AUTHEN_CLR_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_CLR_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_CLR_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED13_AUTHEN_TOG - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED13_AUTHEN_TOG_TZ_USER_MASK (0x100U)
#define CCM_GPR_SHARED13_AUTHEN_TOG_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED13_AUTHEN_TOG_TZ_USER(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TOG_TZ_USER_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TOG_TZ_USER_MASK)

#define CCM_GPR_SHARED13_AUTHEN_TOG_TZ_NS_MASK   (0x200U)
#define CCM_GPR_SHARED13_AUTHEN_TOG_TZ_NS_SHIFT  (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED13_AUTHEN_TOG_TZ_NS(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TOG_TZ_NS_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TOG_TZ_NS_MASK)

#define CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_TZ_MASK (0x800U)
#define CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_TZ(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_TZ_MASK)

#define CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_GPR_SHARED13_AUTHEN_TOG_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED13_AUTHEN_TOG_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED13_AUTHEN_TOG_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED13_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED14 - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED14_m7_adc1_ipg_doze_MASK   (0x1U)
#define CCM_GPR_SHARED14_m7_adc1_ipg_doze_SHIFT  (0U)
/*! m7_adc1_ipg_doze - m7_adc1_ipg_doze */
#define CCM_GPR_SHARED14_m7_adc1_ipg_doze(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_adc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_adc1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_adc2_ipg_doze_MASK   (0x2U)
#define CCM_GPR_SHARED14_m7_adc2_ipg_doze_SHIFT  (1U)
/*! m7_adc2_ipg_doze - m7_adc2_ipg_doze */
#define CCM_GPR_SHARED14_m7_adc2_ipg_doze(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_adc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_adc2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_flexspi1_ipg_doze_MASK (0x4U)
#define CCM_GPR_SHARED14_m7_flexspi1_ipg_doze_SHIFT (2U)
/*! m7_flexspi1_ipg_doze - m7_flexspi1_ipg_doze */
#define CCM_GPR_SHARED14_m7_flexspi1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_flexspi1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_flexspi1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_flexspi2_ipg_doze_MASK (0x8U)
#define CCM_GPR_SHARED14_m7_flexspi2_ipg_doze_SHIFT (3U)
/*! m7_flexspi2_ipg_doze - m7_flexspi2_ipg_doze */
#define CCM_GPR_SHARED14_m7_flexspi2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_flexspi2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_flexspi2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_flexio1_ipg_doze_MASK (0x10U)
#define CCM_GPR_SHARED14_m7_flexio1_ipg_doze_SHIFT (4U)
/*! m7_flexio1_ipg_doze - m7_flexio1_ipg_doze */
#define CCM_GPR_SHARED14_m7_flexio1_ipg_doze(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_flexio1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_flexio1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_flexio2_ipg_doze_MASK (0x20U)
#define CCM_GPR_SHARED14_m7_flexio2_ipg_doze_SHIFT (5U)
/*! m7_flexio2_ipg_doze - m7_flexio2_ipg_doze */
#define CCM_GPR_SHARED14_m7_flexio2_ipg_doze(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_flexio2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_flexio2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_lpit1_ipg_doze_MASK  (0x40U)
#define CCM_GPR_SHARED14_m7_lpit1_ipg_doze_SHIFT (6U)
/*! m7_lpit1_ipg_doze - m7_lpit1_ipg_doze */
#define CCM_GPR_SHARED14_m7_lpit1_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_lpit1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_lpit1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_lpit2_ipg_doze_MASK  (0x80U)
#define CCM_GPR_SHARED14_m7_lpit2_ipg_doze_SHIFT (7U)
/*! m7_lpit2_ipg_doze - m7_lpit2_ipg_doze */
#define CCM_GPR_SHARED14_m7_lpit2_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_lpit2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_lpit2_ipg_doze_MASK)

