Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_CCM.h
#define CCM_GPR_SHARED15_AUTHEN_TOG_TZ_USER_MASK (0x100U)
#define CCM_GPR_SHARED15_AUTHEN_TOG_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED15_AUTHEN_TOG_TZ_USER(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_AUTHEN_TOG_TZ_USER_SHIFT)) & CCM_GPR_SHARED15_AUTHEN_TOG_TZ_USER_MASK)

#define CCM_GPR_SHARED15_AUTHEN_TOG_TZ_NS_MASK   (0x200U)
#define CCM_GPR_SHARED15_AUTHEN_TOG_TZ_NS_SHIFT  (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED15_AUTHEN_TOG_TZ_NS(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_AUTHEN_TOG_TZ_NS_SHIFT)) & CCM_GPR_SHARED15_AUTHEN_TOG_TZ_NS_MASK)

#define CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_TZ_MASK (0x800U)
#define CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_TZ(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_TZ_MASK)

#define CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED15_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_GPR_SHARED15_AUTHEN_TOG_WHITE_LIST_MASK (0xFFFF0000U)
#define CCM_GPR_SHARED15_AUTHEN_TOG_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED15_AUTHEN_TOG_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED15_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED_STATUS - General purpose status register for CM33..General purpose status register for CM7 */
/*! @{ */

#define CCM_GPR_SHARED_STATUS_GPR_STATUS_MASK    (0xFFFFFFFFU)
#define CCM_GPR_SHARED_STATUS_GPR_STATUS_SHIFT   (0U)
/*! GPR_STATUS - Acknowledge indicators for low power handshake */
#define CCM_GPR_SHARED_STATUS_GPR_STATUS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_STATUS_GPR_STATUS_SHIFT)) & CCM_GPR_SHARED_STATUS_GPR_STATUS_MASK)
/*! @} */

/*! @name GPR_PRIVATE - General purpose register */
/*! @{ */

#define CCM_GPR_PRIVATE_GPR_MASK                 (0xFFFFFFFFU)
#define CCM_GPR_PRIVATE_GPR_SHIFT                (0U)
/*! GPR - GP register */
#define CCM_GPR_PRIVATE_GPR(x)                   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_GPR_SHIFT)) & CCM_GPR_PRIVATE_GPR_MASK)
/*! @} */

/*! @name GPR_PRIVATE_SET - General purpose register */
/*! @{ */

#define CCM_GPR_PRIVATE_SET_GPR_MASK             (0xFFFFFFFFU)
#define CCM_GPR_PRIVATE_SET_GPR_SHIFT            (0U)
/*! GPR - GP register */
#define CCM_GPR_PRIVATE_SET_GPR(x)               (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_SET_GPR_SHIFT)) & CCM_GPR_PRIVATE_SET_GPR_MASK)
/*! @} */

/* The count of CCM_GPR_PRIVATE_SET */
#define CCM_GPR_PRIVATE_SET_COUNT                (4U)

/*! @name GPR_PRIVATE_CLR - General purpose register */
/*! @{ */

#define CCM_GPR_PRIVATE_CLR_GPR_MASK             (0xFFFFFFFFU)
#define CCM_GPR_PRIVATE_CLR_GPR_SHIFT            (0U)
/*! GPR - GP register */
#define CCM_GPR_PRIVATE_CLR_GPR(x)               (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_CLR_GPR_SHIFT)) & CCM_GPR_PRIVATE_CLR_GPR_MASK)
/*! @} */

/* The count of CCM_GPR_PRIVATE_CLR */
#define CCM_GPR_PRIVATE_CLR_COUNT                (4U)

/*! @name GPR_PRIVATE_TOG - General purpose register */
/*! @{ */

#define CCM_GPR_PRIVATE_TOG_GPR_MASK             (0xFFFFFFFFU)
#define CCM_GPR_PRIVATE_TOG_GPR_SHIFT            (0U)
/*! GPR - GP register */
#define CCM_GPR_PRIVATE_TOG_GPR(x)               (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_TOG_GPR_SHIFT)) & CCM_GPR_PRIVATE_TOG_GPR_MASK)
/*! @} */

/* The count of CCM_GPR_PRIVATE_TOG */
#define CCM_GPR_PRIVATE_TOG_COUNT                (4U)

/*! @name GPR_PRIVATE_AUTHEN - GPR access control */
/*! @{ */

#define CCM_GPR_PRIVATE_AUTHEN_TZ_USER_MASK      (0x100U)
#define CCM_GPR_PRIVATE_AUTHEN_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission
 *  0b0..Registers of private GPR cannot be changed in user mode.
 *  0b1..Registers of private GPR can be changed in user mode.
 */
#define CCM_GPR_PRIVATE_AUTHEN_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_TZ_USER_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_TZ_USER_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_TZ_NS_MASK        (0x200U)
#define CCM_GPR_PRIVATE_AUTHEN_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_PRIVATE_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_TZ_NS_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_LOCK_TZ_MASK      (0x800U)
#define CCM_GPR_PRIVATE_AUTHEN_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone settings
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_GPR_PRIVATE_AUTHEN_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_LOCK_TZ_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_LOCK_TZ_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_LOCK_LIST_MASK    (0x8000U)
#define CCM_GPR_PRIVATE_AUTHEN_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_GPR_PRIVATE_AUTHEN_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_LOCK_LIST_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_LOCK_LIST_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_GPR_PRIVATE_AUTHEN_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_PRIVATE_AUTHEN_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_WHITE_LIST_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/* The count of CCM_GPR_PRIVATE_AUTHEN */
#define CCM_GPR_PRIVATE_AUTHEN_COUNT             (4U)

/*! @name GPR_PRIVATE_AUTHEN_SET - GPR access control */
/*! @{ */

#define CCM_GPR_PRIVATE_AUTHEN_SET_TZ_USER_MASK  (0x100U)
#define CCM_GPR_PRIVATE_AUTHEN_SET_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_PRIVATE_AUTHEN_SET_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_SET_TZ_USER_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_SET_TZ_NS_MASK    (0x200U)
#define CCM_GPR_PRIVATE_AUTHEN_SET_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_PRIVATE_AUTHEN_SET_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_SET_TZ_NS_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_GPR_PRIVATE_AUTHEN_SET_LOCK_LIST_MASK)

